Revit 2024 API
LoadCombination Class
 An object that represents a load combination.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class LoadCombination : Element
Visual Basic
Public Class LoadCombination _
	Inherits Element
Visual C++
public ref class LoadCombination : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.LoadCombination
See Also
LoadCombination Members
Autodesk.Revit.DB.Structure Namespace